{
  "blogs": [
    {
      "articleTitle": "Getting Started",
      "shortTitle": "getting_started",
      "articleContent": "<h2 class=\"post\">Getting Started</h2><p class=\"post\">I've been in information technologies for eight years now. I love it! It has given me a lot of opportunties, and I've had the pleasure of working with some amazing people along the way. Great people have given me cool opportunties.</p><p class=\"post\">While I appreciate all the opportunties I've had, my career has happened without much direction on my part. That's really due to not knowing what I wanted to do in IT.</p><p class=\"post\">I have finally figured it out, though. I want to be a developer. To become a developer, though, I need projects. So I figured I'd start a blog about my journey from operations to development.</p><p class=\"post\">This website is my learning platform, and I look forward to sharing my journey with you. I'll share my thoughts, struggles, and dreams, and maybe we'll find some things we have in common. I hope you enjoy.</p><p class=\"post\">Keep coding and God bless!</p>"
    },
    {
      "articleTitle": "Pep Talk",
      "shortTitle": "pep_talk",
      "articleContent": "<h2 class=\"post\">Pep Talk</h2><p class=\"post\">This stuff is hard. Don't get discouraged because you don't get it right away.</p><p class=\"post\">Back when the world was young, I had thought about being a computer science major in college. I took an intro CS class that taught Fortran, and decided that I didn't have the knack, eventually becoming an English literature major.</p><p class=\"post\">Fast forward five years, and I'm looking for a career change. (Surprise! Surprise!) My dad turns me onto networking. As I'm forging my career in IT, I think of programmers as <i>real IT that I'm not smart enough for.</i> After looking around a little, though, I begin to think that maybe I can do it, and furthermore, I think it might be what I really want to do.</p><p class=\"post\">I return to the community college where I orchestrated my career change into networking, and I get a software developer certificate. Pardon the meander, but here's my point: I still struggled with programming. I have yet to have that magic aha moment where I, all of a sudden, start \"thinking like a programmer,\" despite getting straight A's and being the model student. Most of my classmates struggled more than I did, and I still don't get it.</p><p class=\"post\">I will, though, and you will, too. Stick with it. Don't overanalyze it. Just shut up and code.</p>"
    },
    {
      "articleTitle": "Small Potatoes",
      "shortTitle": "small_potatoes",
      "articleContent": "<h2 class=\"post\">Small Potatoes</h2><p class=\"post\">I know this website isn't much. I know the design leaves a lot to be desired. I know the colors I've chosen are a little off.</p><p class=\"post\">But you know what? That's alright.</p><p class=\"post\">I'm still learning, and building this website is meant to help me learn. I want to put together the best website I can, but that doesn't mean I'm going to build the greatest site the world has ever seen overnight.</p><p class=\"post\">Don't be afraid to put yourself out there if it helps you grow. Don't be untrue to yourself. Don't put yourself out there as the grand master of coding because you know how to write links in HTML. There's no shame in learning. There's no shame in being earlier in the path than someone else.</p>"
    }
  ]
}
